In [2]:
import pandas as pd
obj=pd.Series([4,7,-1,3])
obj

0    4
1    7
2   -1
3    3
dtype: int64

In [14]:
import numpy as np
obj2=pd.Series([4,7,-1,3],index=['a','b','c','d'])
np.sqrt(obj2[['a','b']]**2)

a    4.0
b    7.0
dtype: float64

In [19]:
dictdata={'a':4,'b':7,'c':-1,'d':3}
#obj3=pd.Series(dictdata)
letter=['d','c','b','a']
obj3=pd.Series(dictdata,index=letter)
obj3.name='num_letter'
obj3.index.name='letter'
obj3

letter
d    3
c   -1
b    7
a    4
Name: num_letter, dtype: int64

In [50]:
data={'city':['Guangzhou','Beijing','Shanghai'],
     'year':[2000,2001,2019],
     'population':[1.4,1.8,3]}
frame=pd.DataFrame(data,columns=['year','city','population','income'])
val=pd.Series([400,500],index=[0,2])
frame.income=val
frame

   year       city  population  income
0  2000  Guangzhou         1.4   400.0
1  2001    Beijing         1.8     NaN
2  2019   Shanghai         3.0   500.0

In [38]:
del frame['income']
frame

   year       city  population
0  2000  Guangzhou         1.4
1  2001    Beijing         1.8
2  2019   Shanghai         3.0

In [68]:
data1={'Guangzhou':{2001:2.4,2005:4.6},
     'Beijing':{2001:3.5,2019:10},
     'Shanghai':{2001:3.9,2008:18}}
frame1=pd.DataFrame(data1)
frame1.T
frame1.index.name='year'
frame1.columns.name='city'
frame1

city  Guangzhou  Beijing  Shanghai
year
2001        2.4      3.5       3.9
2005        4.6      NaN       NaN
2008        NaN      NaN      18.0
2019        NaN     10.0       NaN

In [71]:
frame1.values
frame.values

array([[2000, 'Guangzhou', 1.4, 400.0],
       [2001, 'Beijing', 1.8, nan],
       [2019, 'Shanghai', 3.0, 500.0]], dtype=object)

In [82]:
obj4=pd.Series([4.5,7.2,-5.3,7.3],index=['b','a','c','d'])
obj5=obj4.reindex(['a','b','c','d','e'])
obj5

a    7.2
b    4.5
c   -5.3
d    7.3
e    NaN
dtype: float64

In [87]:
obj6 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj6.reindex(range(6), method='ffill')
obj7=obj6.drop(0)
obj7

2    purple
4    yellow
dtype: object

In [119]:
obj8= pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
#obj9=obj8.drop('two',axis=1)
obj8
#obj8.loc['Ohio',['one','four']]
#obj8.iloc[1,1]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
obj10=pd.Series(np.arange(4),index=['a','b','c','d'])
obj10['b':'c']=10 #用标签进行的切片包含末端，不同于其他切片
obj10

a     0
b    10
c    10
d     3
dtype: int32

In [121]:
s1=pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'd', 'e', 'g'])
s1+s2

a    5.2
c    1.1
d    1.9
e    5.5
g    NaN
dtype: float64

In [122]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [131]:
df3=pd.DataFrame(np.arange(16).reshape(4,4),columns=list('abcd'))
df4=pd.DataFrame(np.arange(25).reshape(5,5),columns=list('abcde'))
df3.add(df4,fill_value=0)
df3.rdiv(2)

          a         b         c         d
0       inf  2.000000  1.000000  0.666667
1  0.500000  0.400000  0.333333  0.285714
2  0.250000  0.222222  0.200000  0.181818
3  0.166667  0.153846  0.142857  0.133333

In [8]:
import pandas as pd
import numpy as np
df5=pd.DataFrame([[1,4,np.nan],[4,2,7],[np.nan,np.nan,np.nan]],index=list('abc'),columns=['one','two','three'])
df5

   one  two  three
a  1.0  4.0    NaN
b  4.0  2.0    7.0
c  NaN  NaN    NaN

In [15]:
df5.sum(axis=1)
df5.mean(axis='columns',skipna=False)
df5.describe()

           one       two  three
count  2.00000  2.000000    1.0
mean   2.50000  3.000000    7.0
std    2.12132  1.414214    NaN
min    1.00000  2.000000    7.0
25%    1.75000  2.500000    7.0
50%    2.50000  3.000000    7.0
75%    3.25000  3.500000    7.0
max    4.00000  4.000000    7.0

In [16]:
obj11=pd.Series(['a','d','c','e','a','a','ux'])
obj11.describe()

count     7
unique    5
top       a
freq      3
dtype: object

In [17]:
df6=pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
result=df6.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0